app/controllers/home_controller.rb

  def register
  	name=params[:name]
  	email=params[:email]
  	if name!="" && email!=""
  		u=User.new
  		u.first_name=name
  		u.email=email
  		u.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 11 Dec 2013 21:43:40 UTC +00:00], ["email", "email@email.com"], ["first_name", "Nombre nombre"], ["updated_at", Wed, 11 Dec 2013 21:43:40 UTC +00:00]]